Autodesk.Revit.DB.CellType.CustomField
Data bounded to a Schedule Custom Field.

Autodesk.Revit.DB.CellType.CalculatedValue
The type is a calculated value

Autodesk.Revit.DB.CellType.CombinedParameter
The type is combined parameter